package day0111;

/**
 * 아래의 작업을 instance method로 만들어 사용하는 class를 작성하고, 사용해보세요.
 * 주민번호의 형식은 xxxxxx-xxxxx입니다.
 * 1. 주민번호를 입력받아 instance 변수에 저장하는 생성자를 생성하세요.
 * 2. 인스턴스 변수에 저장된 주민번호의 글자수가 14자리인지를 체크하여 boolean으로 반환
 * 3. 인스턴스 변수에 저장된  주민번호의 7번째 인덱스에 – 가 있는지 체크하여 boolean으로 반환하는 일을 하는 method를 작성하세요.
 * 4. 인스턴스 변수에 저장된 주민 번호에서 생년월일을 연산하여 문자열로 반환하는 일을 하는 method를 작성하세요.
 * 5. 입력된 주민번호에서 나이를 구해서 정수로 반환하는 method를 작성하세요.
 * 6. 입력된 주민번호에서 성별을 구해 문자열로 반환하는 method를 작성하세요.
 * 7. 입력된 주민번호에서 띠를 구하여 문자열로 반환하는 method를 작성하세요.
 */
public class Exam0111 {

	public static void main(String[] args) {
		
	}

}
